app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-11-05 15:14:30.962251"], ["updated_at", "2018-11-05 15:14:30.962251"]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Computer Science"], ["room_number", 5], ["updated_at", "2018-11-05 15:27:12.991212"], ["id", 1]]
---
  def create
    @school_class = SchoolClass.create
    @school_class[:title] = params[:school_class][:title]
    @school_class[:room_number] = params[:school_class][:room_number]
    @school_class.save