app/controllers/students_controller.rb

  def create
    @student = Student.create
    @student[:first_name] = params[:student][:first_name]
    @student[:last_name] = params[:student][:last_name]
    @student.save
---
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-11-05 15:27:13.034424"], ["updated_at", "2018-11-05 15:27:13.034424"]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Bill"], ["last_name", "Smith"], ["updated_at", "2018-11-05 15:27:13.036602"], ["id", 1]]